---
kind: type
id: T:Autodesk.Revit.DB.Electrical.CircuitNaming
source: html/e3e6582d-f4f9-03db-9cd3-2c74276fec84.htm
---
# Autodesk.Revit.DB.Electrical.CircuitNaming

An enumerated type listing all the circuit naming options.

## Syntax (C#)
```csharp
public enum CircuitNaming
```